import subprocess

# 定义要测试的域名
domain = "papals.org"

# 定义要测试的DNS服务器地址和备注信息
dns_servers = [
  ("61.132.163.68", "安徽电信 DNS"),
  ("219.141.136.10", "北京电信 DNS"),
  ("61.128.192.68", "重庆电信 DNS"),
  ("218.85.152.99", "福建电信 DNS"),
  ("202.100.64.68", "甘肃电信 DNS"),
  ("202.96.128.86", "广东电信 DNS"),
  ("202.96.134.33", "广东电信 DNS"),
  ("202.103.225.68", "广西电信 DNS"),
  ("202.98.192.67", "贵州电信 DNS"),
  ("222.88.88.88", "河南电信 DNS"),
  ("219.147.198.230", "黑龙江电信 DNS"),
  ("202.103.24.68", "湖北电信 DNS"),
  ("222.246.129.80", "湖南电信 DNS"),
  ("218.2.2.2", "江苏电信 DNS"),
  ("61.147.37.1", "江苏电信 DNS"),
  ("202.101.224.69", "江西电信 DNS"),
  ("219.148.162.31", "内蒙古电信 DNS"),
  ("219.146.1.66", "山东电信 DNS"),
  ("218.30.19.40", "陕西电信 DNS"),
  ("202.96.209.133", "上海电信 DNS"),
  ("202.96.209.5", "上海电信 DNS"),
  ("61.139.2.69", "四川电信 DNS"),
  ("219.150.32.132", "天津电信 DNS"),
  ("222.172.200.68", "云南电信 DNS"),
  ("202.101.172.35", "浙江电信 DNS"),
  ("61.153.81.75", "浙江电信 DNS"),
  ("123.123.123.123", "北京联通 DNS"),
  ("202.106.0.20", "北京联通 DNS"),
  ("221.5.203.98", "重庆联通 DNS"),
  ("210.21.196.6", "广东联通 DNS"),
  ("202.99.160.68", "河北联通 DNS"),
  ("202.102.224.68", "河南联通 DNS"),
  ("202.97.224.69", "黑龙江联通 DNS"),
  ("202.98.0.68", "吉林联通 DNS"),
  ("221.6.4.66", "江苏联通 DNS"),
  ("202.99.224.68", "内蒙古联通 DNS"),
  ("202.102.128.68", "山东联通 DNS"),
  ("202.102.134.68", "山东联通 DNS"),
  ("202.99.192.66", "山西联通 DNS"),
  ("221.11.1.67", "陕西联通 DNS"),
  ("210.22.70.3", "上海联通 DNS"),
  ("119.6.6.6", "四川联通 DNS"),
  ("202.99.104.68", "天津联通 DNS"),
  ("221.12.1.227", "浙江联通 DNS"),
  ("202.96.69.38", "辽宁联通 DNS"),
  ("221.131.143.69", "江苏移动 DNS"),
  ("211.138.180.2", "安徽移动 DNS"),
  ("218.201.96.130", "山东移动 DNS"),
  ("221.179.38.7", "广东移动 DNS"),
  ("211.136.192.6", "广东移动 DNS")
]

# 循环测试每个DNS服务器
for dns_server, dns_name in dns_servers:
    print("Testing DNS server:", dns_name, "({})".format(dns_server))
    
    # 使用subprocess模块运行dig命令测试DNS服务器
    cmd = ["dig", "+short", "@" + dns_server, domain]
    output = subprocess.check_output(cmd).decode().strip()
    
    # 输出测试结果
    if output == "":
        print("DNS server returned no result")
    else:
        print(output)
    
    print("")